import React from 'react';
import styles from './Oferta.module.css';

const Oferta = () => {
    return (
        <div className={styles.ofertaContainer}>
            <h1 className={styles.ofertaTitle}>Договор-оферта</h1>

            <div className={styles.ofertaContent}>
                <p>Настоящий Договор является публичным договором офертой (предложением) ИП Иванова Кристина Алексеевна (далее - Исполнитель) с любым физическим или юридическим лицом (далее - Заказчик), которое примет настоящее предложение на указанных ниже условиях.</p>
                <p>В соответствии с пунктом 2 статьи 437 Гражданского Кодекса Российской Федерации (ГК РФ), в случае принятия изложенных ниже условий и оплаты услуг юридическое или физическое лицо, производящее акцепт этой оферты, становится Заказчиком (в соответствии с пунктом 3 статьи 438 ГК РФ акцепт оферты равносилен заключению Договора на условиях, изложенных в оферте).</p>
                <p>Моментом полного и безоговорочного принятия Заказчиком предложения Исполнителя заключить договор оферты (акцептом оферты) считается факт предоплаты Заказчиком услуг Исполнителя.</p>
                <p>Осуществляя акцепт настоящего Договора-оферты, Заказчик подтверждает, что он ознакомлен, согласен, полностью и безоговорочно принимает все условия Договора-оферты в том виде, в каком они изложены в тексте Договора-оферты.</p>
                <p>Заказчик согласен, что акцепт Договора-оферты является заключением Договора на условиях, изложенных в нем.</p>
                <p>Совершая действия по акцепту Договора-оферты, Заказчик гарантирует, что он имеет законные права вступать в договорные отношения с Исполнителем.</p>
                <p>В случае если Заказчик не согласен с каким-либо пунктом Договора-оферты, ему предлагается отказаться от использования услуг Исполнителя.</p>
                <p>Договор-оферта не требует скрепления печатями и/или подписания Заказчиком и Исполнителем и сохраняет при этом юридическую силу.</p>
                <p>Исполнитель и Заказчик именуются по тексту Договора-оферты – Стороны.</p>

                <h2>1. ПРЕДМЕТ ДОГОВОРА-ОФЕРТЫ</h2>
                <p>1.1. Исполнитель принимает на себя обязательства по оказанию информационно-консультационных услуг по программе: «Шоколадный курс» (далее - Курс) в порядке и сроки, предусмотренные настоящим Договором-офертой, а Заказчик обязуется оплатить оказываемые Исполнителем услуги в порядке и на условиях, предусмотренных Договором-офертой.</p>
                <p>1.2. Информация о содержании, стоимости, сроках и условиях оказания информационно-консультационных услуг размещена на сайте Исполнителя nadoshokolada.ru (далее – Сайт).</p>
                <p>1.3. Заключая настоящий Договор-оферту, Заказчик подтверждает, что ознакомлен с программой Курса, ценами и условиями её проведения.</p>
                <p>1.4. После завершения информационно-консультационных услуг, если это предусмотрено программой Курса Заказчику выдается электронное свидетельство о его прохождении.</p>
                <p>1.5. Услуги по настоящему Договору ограничены предоставлением Заказчику информации и формированием навыков её использования для определенных целей, и не являются образовательной деятельностью, деятельностью по психологическому консультированию или медицинской деятельностью.</p>

                <h2>2. ПРАВА И ОБЯЗАННОСТИ СТОРОН</h2>
                <p>2.1. Исполнитель обязан:</p>
                <p>2.1.1. Предоставить Заказчику доступ к информационно-консультационным услугам.</p>
                <p>2.1.2. Предоставить Заказчику доступ к учебным материалам после поступления полной оплаты от Заказчика в срок, указанный Исполнителем.</p>
                <p>2.1.3. Предоставить информационно-консультационные услуги в соответствии с выбранной программой Курса и оплаченным тарифом.</p>
                <p>2.1.4. Использовать все личные данные и иную конфиденциальную информацию о Заказчике только для оказания услуг, не передавать третьим лицам находящуюся у него информацию и документацию о Заказчике, за исключением случаев, предусмотренных действующим законодательством РФ.</p>
                <p>2.1.5. Проводить консультации для Заказчика, если это предусмотрено выбранной программой Курса и оплаченным тарифом.</p>
                <p>2.1.6. Проверять выполненные домашние задания Заказчика, если это предусмотрено выбранной программой Курса и оплаченным тарифом.</p>
                <p>2.1.7. Сохранять конфиденциальную информацию, полученную от Заказчика в рамках оказания информационно-консультационных услуг по программе Курса.</p>
                <p>2.1.8. Соблюдать требования законодательства, касающиеся обработки, передачи и защиты персональных данных Заказчика.</p>

                <p>2.2. Исполнитель имеет право:</p>
                <p>2.2.1. Не предоставлять Заказчику информационно-консультационные услуги до момента их оплаты.</p>
                <p>2.2.2. Приостановить предоставление Заказчику информационно-консультационных услуг в случаях нарушения Заказчиком требований настоящего Договора-оферты.</p>
                <p>2.2.3. Расторгнуть Договор-оферту в одностороннем порядке в случаях, предусмотренных п. 6.3.1. и 6.3.2. Договора-оферты.</p>
                <p>2.2.4. Привлекать к оказанию услуг третьих лиц без предварительного получения на то согласия Заказчика.</p>
                <p>2.2.5. Изменять и дополнять текст Договора-оферты без предварительного согласования с Заказчиком, обеспечивая при этом размещение изменений и дополнений на Сайте Исполнителя.</p>
                <p>2.2.6. Не допускать на курс и не давать обратную связь по заданиям лицам, допускающим недопустимое поведение (распространение спама, реферальных ссылок, грубое общение и т.п.)</p>

                <p>2.3. Заказчик обязан:</p>
                <p>2.3.1. Оплачивать информационно-консультационные услуги в порядке, размере и сроки, предусмотренные Договором-офертой.</p>
                <p>2.3.2. Соблюдать исключительные и авторские права Исполнителя и иных третьих лиц.</p>
                <p>2.3.3. Немедленно уведомить Исполнителя об изменении своих персональных и контактных данных.</p>
                <p>2.3.4. Выполнять все правила участия, отраженные в настоящем Договоре-оферте.</p>
                <p>2.3.5. Не распространять (не публиковать, не размещать в общедоступных источниках, не передавать или иным образом не доводить до сведения других лиц) в коммерческих или некоммерческих целях содержащиеся на Сайте и в Курсе материалы, за исключением случаев прямо предусмотренных законодательством Российской Федерации.</p>
                <p>2.3.6. Не передавать третьим лицам информацию, полученную от Исполнителя в рамках оказания информационно-консультационных услуг. Не совершать действий, направленных на получение доступа к личному кабинету другого Заказчика, путем подбора его логина и пароля, а также не предпринимать иных действий, направленных на изменение функционирования и работоспособности Сайта.</p>

                <p>2.4. Заказчик имеет право:</p>
                <p>2.4.1. Прекратить пользоваться информационно-консультационными услугами Исполнителя в одностороннем порядке. В этом случае оплата, произведенная за информационно-консультационные услуги, возврату не подлежит, за исключением условий, прямо предусмотренных в Договоре-оферте.</p>
                <p>2.4.2. Получать информационно-консультационные услуги в соответствии с условиями настоящего Договора-оферты.</p>
                <p>2.4.3. Получать информацию об изменениях в программе Курса в порядке, предусмотренном настоящим Договором-офертой.</p>
                <p>2.4.4. Заказчик имеет право отказаться от участия на Курсе, на условиях и в порядке, предусмотренных настоящим Договором-офертой и действующим законодательством РФ.</p>

                <h2>3. ПОРЯДОК И УСЛОВИЯ ОКАЗАНИЯ УСЛУГ</h2>
                <p>3.1. Заказчик оплачивает информационно-консультационные услуги по выбранной им программе Курса, стоимость которых размещена на Сайте.</p>
                <p>3.2. Оплата услуг производится в порядке 100 % предоплаты.</p>
                <p>3.3. После зачисления денежных средств на счет Исполнителя, в сроки, указанные на Сайте, Заказчику предоставляется доступ в закрытую платформу в сети Интернет (доступ к Курсу).</p>
                <p>3.4. В случае неполучения доступа в закрытую платформу в установленные сроки, Заказчик обязан незамедлительно, но не позднее, чем через 5 (пять) календарных дней, уведомить об этом Исполнителя. В противном случае Заказчик считается получившим доступ к Курсу.</p>
                <p>3.5. Информационно-консультационные услуги считаются оказанными с надлежащим качеством и принятыми Заказчиком, если в течение 5 (пяти) календарных дней с момента получения доступа к Курсу Заказчик не направил в адрес Исполнителя мотивированного отказа от принятия услуг, оказанных по Договору-оферте. Подписание Акта об оказании услуг в рамках настоящего Договора-оферты не требуется.</p>

                <h2>4. ПОРЯДОК РАССЧЕТОВ</h2>
                <p>4.1. Стоимость оказываемых Исполнителем информационно-консультационных услуг по программе Курса определяется на основании действующих тарифов, размещенных на Сайте.</p>
                <p>4.2. Оплата информационно-консультационных услуг по настоящему Договору-оферте осуществляется на условиях 100 % (сто процентной) предоплаты в рублях Российской Федерации.</p>
                <p>4.3. Моментом исполнения Заказчиком обязанности по оплате является момент зачисления денежных средств Заказчика на расчетный счет Исполнителя.</p>

                <h2>5. ОТВЕТСТВЕННОСТЬ СТОРОН ПО ДОГОВОРУ-ОФЕРТЕ</h2>
                <p>5.1. Исполнитель не несет ответственности:</p>
                <p>5.1.1. За невозможность оказания услуг Заказчику по причинам, не зависящим от Исполнителя.</p>
                <p>5.1.2. За неоднократные или постоянные прерывания в работе Сайта или онлайн платформы, по которым проводятся услуги, вызванные техническими неисправностями не зависящими от Исполнителя.</p>
                <p>5.1.3. За любые прямые или косвенные убытки, произошедшие из-за использования либо невозможности использования Сайта, либо его отдельных сервисов Заказчиком по вине третьих лиц.</p>
                <p>5.1.4. За содержание сообщений или материалов Заказчика, любую информацию, которая размещена на Сайте третьими лицами.</p>
                <p>5.1.5. За возможную утрату Заказчиком реквизитов доступа в личном кабинете Заказчика (платформы, личного кабинета и др., используемой площадки), либо их кражу третьими лицами.</p>
                <p>5.2. В случае если по какой-либо причине Исполнитель не оказывает услуги в срок, ответственность Исполнителя ограничивается исключительно оказанием информационно-консультационных услуг в новые сроки.</p>

                <h2>6. СРОК ДЕЙСТВИЯ ДОГОВОРА-ОФЕРТЫ. ПОРЯДОК ИЗМЕНЕНИЯ И РАСТОРЖЕНИЯ</h2>
                <p>6.1. Договор-оферта вступает в силу со дня его акцепта Заказчиком и действует до полного исполнения Сторонами своих обязательств.</p>
                <p>6.2. Исполнитель имеет право изменять условия настоящего Договора-оферты и дополнения к Договору-оферте без предварительного согласования с Заказчиком, обеспечивая при этом публикацию измененных условий на Сайте.</p>
                <p>6.3. Договор-оферта может быть расторгнут до окончания срока действия в следующих случаях:</p>
                <p>6.3.1. По соглашению Сторон в любое время до окончания срока действия Договора-оферты.</p>
                <p>6.3.2. В одностороннем порядке Исполнителем в случае нарушения Заказчиком условий настоящего Договора-оферты.</p>
                <p>6.3.3. В одностороннем порядке Заказчиком с предварительным уведомлением Исполнителя по электронной почте не менее чем за 3 дня до окончания срока действия Договора-оферты. Возврат денежных средств при расторжении Договора по инициативе Заказчика не предусмотрен, кроме случаев, прямо предусмотренных Договором-офертой.</p>
                <p>6.4. В случае расторжения Договора до предоставления Заказчику информационно-консультационных услуг, Исполнитель возвращает Заказчику оплату за вычетом фактически понесенных расходов.</p>
                <p>6.5. В случае расторжения Договора-оферты, Исполнитель незамедлительно блокирует доступ Заказчика к платформе, на которой проводятся занятия.</p>

                <h2>7. РАЗРЕШЕНИЕ СПОРОВ ПО ДОГОВОРУ-ОФЕРТЕ</h2>
                <p>7.1. Все споры или разногласия, возникающие между Сторонами по настоящему Договору-оферте или в связи с ним, разрешаются путем переговоров между ними.</p>
                <p>7.2. В случае невозможности разрешения разногласий путем переговоров, они подлежат рассмотрению в суде в порядке, установленном законодательством Российской Федерации.</p>

                <h2>8. ОБРАБОТКА ПЕРСОНАЛЬНЫХ ДАННЫХ ЗАКАЗЧИКА</h2>
                <p>8.1. Акцептуя настоящую оферту, Заказчик в соответствии с Федеральным законом от 27 июля 2006 года № 152-ФЗ «О персональных данных» выражает согласие на предоставление своих персональных данных и их обработку Исполнителем.</p>
                <p>8.2. Персональные данные предоставляются путем заполнения соответствующих форм на Сайте и могут обновляться путем повторного заполнения форм.</p>
                <p>8.3. Исполнитель гарантирует конфиденциальность в отношении персональных данных Заказчика и их безопасность при обработке.</p>
                <p>8.4. Согласие на обработку персональных данных действует бессрочно, но может быть отозвано Заказчиком на основании его письменного заявления, направленного в адрес Исполнителя по электронной почте.</p>

                <h2>9. ПРОЧИЕ УСЛОВИЯ</h2>
                <p>9.1. Заказчик гарантирует, что ознакомлен с Пользовательским соглашением и Политикой конфиденциальности, размещенными на Сайте Исполнителя.</p>
                <p>9.2. Любые уведомления по Договору-оферте могут направляться одной Стороной другой Стороне по электронной почте.</p>
                <p>9.3. Признание судом какого-либо положения Договора-оферты недействительным или не подлежащим принудительному исполнению не влечет недействительности иных его положений.</p>

                <h2>10. РЕКВИЗИТЫ ИСПОЛНИТЕЛЯ</h2>
                <p>ИП Иванова Кристина Алексеевна</p>
                <p>ИНН 222446654123</p>
                <p>ОГРНИП 5417746053123</p>
                <p>Адрес: г. Москва, ул. Профсоюзная д. 152 к. 2 кв. 312</p>
                <p>Р/с: 40802810401500079228</p>
                <p>в ТОЧКА ПАО БАНКА ФК «ОТКРЫТИЕ»</p>
                <p>К/с: 30101810845250000999</p>
                <p>БИК: 044525999</p>
                <p>Эл. почта: chocolate.course@gmail.com</p>
            </div>
        </div>
    );
};

export default Oferta;