import React from 'react';
import styles from './Privacy.module.css';

const Privacy = () => {
    return (
        <div className={styles.policyContainer}>
            <h1 className={styles.policyTitle}>Политика конфиденциальности</h1>

            <div className={styles.policyContent}>
                <p>Настоящая Политика конфиденциальности персональных данных (далее – Политика конфиденциальности) действует в отношении всей информации, которую ИП Иванова Кристина Алексеевна (далее - Исполнитель), может получить о Пользователе во время использования сайта, расположенного на доменном имени nadoshokolada.ru</p>

                <h2>1. ОБЩИЕ ПОЛОЖЕНИЯ</h2>
                <p>1.1. Использование Пользователем сайта nadoshokolada.ru означает согласие с настоящей Политикой конфиденциальности и условиями обработки персональных данных Пользователя.</p>
                <p>1.2. В случае несогласия с условиями Политики конфиденциальности Пользователь должен прекратить использование сайта nadoshokolada.ru.</p>
                <p>1.3. Настоящая Политика конфиденциальности применяется только к сайту nadoshokolada.ru. Сайт не контролирует и не несет ответственность за сайты третьих лиц, на которые Пользователь может перейти по ссылкам, доступным на сайте nadoshokolada.ru.</p>
                <p>1.4. Администрация сайта не проверяет достоверность персональных данных, предоставляемых Пользователем сайта nadoshokolada.ru.</p>

                <h2>2. ПРЕДМЕТ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ</h2>
                <p>2.1. Настоящая Политика конфиденциальности устанавливает обязательства Исполнителя по неразглашению и обеспечению режима защиты конфиденциальности персональных данных, которые Пользователь предоставляет по запросу Администрации сайта при регистрации на сайте nadoshokolada.ru или при оформлении заказа для приобретения Товара.</p>
                <p>2.2. Персональные данные, разрешённые к обработке в рамках настоящей Политики конфиденциальности, предоставляются Пользователем путём заполнения регистрационной формы на Сайте nadoshokolada.ru в разделе оформления заказа и включают в себя следующую информацию:</p>
                <p>2.2.1. фамилию, имя, отчество Пользователя;</p>
                <p>2.2.2. контактный телефон Пользователя;</p>
                <p>2.2.3. адрес электронной почты (e-mail);</p>
                <p>2.2.4. место жительство Пользователя (при необходимости);</p>
                <p>2.2.5. адрес доставки Товара (при необходимости);</p>
                <p>2.2.6. название компании (при необходимости).</p>
                <p>2.3. Администрация сайта защищает Данные, которые автоматически передаются в процессе просмотра рекламных блоков и при посещении страниц, на которых установлен статистический скрипт системы ("пиксель"):</p>
                <p>• IP адрес;</p>
                <p>• информация из cookies;</p>
                <p>• информация о браузере (или иной программе, которая осуществляет доступ к показу рекламы);</p>
                <p>• время доступа;</p>
                <p>• адрес страницы, на которой расположен рекламный блок;</p>
                <p>• реферер (адрес предыдущей страницы).</p>
                <p>2.3.1. Отключение cookies может повлечь невозможность доступа к частям сайта nadoshokolada.ru, требующим авторизации.</p>
                <p>2.3.2. Администрация сайта осуществляет сбор статистики об IP-адресах своих посетителей. Данная информация используется с целью выявления и решения технических проблем, для контроля законности проводимых финансовых платежей.</p>
                <p>2.4. Любая иная персональная информация неоговоренная выше (история покупок, используемые браузеры и операционные системы и т.д.) подлежит надежному хранению и нераспространению, за исключением случаев, предусмотренных в п.п. 4.2. и 4.3. настоящей Политики конфиденциальности.</p>

                <h2>3. ЦЕЛИ СБОРА ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЯ</h2>
                <p>3.1. Персональные данные Пользователя Администрация сайта nadoshokolada.ru может использовать в целях:</p>
                <p>3.1.1. Идентификации Пользователя, зарегистрированного на сайте nadoshokolada.ru, для оформления заказа и (или) заключения Договора купли-продажи товара дистанционным способом с ИП Иванова Кристина Алексеевна.</p>
                <p>3.1.2. Предоставления Пользователю доступа к персонализированным ресурсам Сайта nadoshokolada.ru.</p>
                <p>3.1.3. Установления с Пользователем обратной связи, включая направление уведомлений, запросов, касающихся использования Сайта nadoshokolada.ru, оказания услуг, обработка запросов и заявок от Пользователя.</p>
                <p>3.1.4. Определения места нахождения Пользователя для обеспечения безопасности, предотвращения мошенничества.</p>
                <p>3.1.5. Подтверждения достоверности и полноты персональных данных, предоставленных Пользователем.</p>
                <p>3.1.6. Создания учетной записи для совершения покупок, если Пользователь дал согласие на создание учетной записи.</p>
                <p>3.1.7. Уведомления Пользователя Сайта nadoshokolada.ru о состоянии Заказа.</p>
                <p>3.1.8. Обработки и получения платежей, подтверждения налога или налоговых льгот, оспаривания платежа.</p>
                <p>3.1.9. Предоставления Пользователю эффективной клиентской и технической поддержки при возникновении проблем связанных с использованием Сайта nadoshokolada.ru.</p>
                <p>3.1.10. Предоставления Пользователю с его согласия, обновлений продукции, специальных предложений, информации о ценах, новостной рассылки и иных сведений от имени Исполнителя или от имени партнеров Исполнителя.</p>
                <p>3.1.11. Осуществления рекламной деятельности с согласия Пользователя.</p>
                <p>3.1.12. Предоставления доступа Пользователю на сайты или сервисы партнеров Исполнителя с целью получения продуктов, обновлений и услуг.</p>

                <h2>4. СПОСОБЫ И СРОКИ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ</h2>
                <p>4.1. Обработка персональных данных Пользователя осуществляется без ограничения срока, любым законным способом, в том числе в информационных системах персональных данных с использованием средств автоматизации или без использования таких средств.</p>
                <p>4.2. Пользователь соглашается с тем, что Администрация сайта вправе передавать персональные данные третьим лицам, в частности, курьерским службам, организациями почтовой связи, операторам электросвязи, исключительно в целях выполнения заказа Пользователя, оформленного на Сайте nadoshokolada.ru включая доставку Товара.</p>
                <p>4.3. Персональные данные Пользователя могут быть переданы уполномоченным органам государственной власти Российской Федерации только по основаниям и в порядке, установленным законодательством Российской Федерации.</p>
                <p>4.4. При утрате или разглашении персональных данных Администрация сайта информирует Пользователя об утрате или разглашении персональных данных.</p>
                <p>4.5. Администрация сайта принимает необходимые организационные и технические меры для защиты персональной информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий третьих лиц.</p>
                <p>4.6. Администрация сайта совместно с Пользователем принимает все необходимые меры по предотвращению убытков или иных отрицательных последствий, вызванных утратой или разглашением персональных данных Пользователя.</p>

                <h2>5. ОБЯЗАТЕЛЬСТВА СТОРОН</h2>
                <p>5.1. Пользователь обязан:</p>
                <p>5.1.1. Предоставить информацию о персональных данных, необходимую для пользования Сайтом nadoshokolada.ru.</p>
                <p>5.1.2. Обновить, дополнить предоставленную информацию о персональных данных в случае изменения данной информации.</p>
                <p>5.2. Администрация сайта обязана:</p>
                <p>5.2.1. Использовать полученную информацию исключительно для целей, указанных в п. 3 настоящей Политики конфиденциальности.</p>
                <p>5.2.2. Обеспечить хранение конфиденциальной информации в тайне, не разглашать без предварительного письменного разрешения Пользователя, а также не осуществлять продажу, обмен, опубликование, либо разглашение иными возможными способами переданных персональных данных Пользователя, за исключением п.п. 4.2. и 4.3. настоящей Политики Конфиденциальности.</p>
                <p>5.2.3. Принимать меры предосторожности для защиты конфиденциальности персональных данных Пользователя согласно порядку, обычно используемого для защиты такого рода информации в существующем деловом обороте.</p>
                <p>5.2.4. Осуществить блокирование персональных данных, относящихся к соответствующему Пользователю, с момента обращения или запроса Пользователя или его законного представителя либо уполномоченного органа по защите прав субъектов персональных данных на период проверки, в случае выявления недостоверных персональных данных или неправомерных действий.</p>

                <h2>6. ОТВЕТСТВЕННОСТЬ СТОРОН</h2>
                <p>6.1. Администрация сайта, не исполнившая свои обязательства, несёт ответственность за убытки, понесённые Пользователем в связи с неправомерным использованием персональных данных, в соответствии с законодательством Российской Федерации, за исключением случаев, предусмотренных п.п. 4.2., 4.3. и 6.2. настоящей Политики Конфиденциальности.</p>
                <p>6.2. В случае утраты или разглашения Конфиденциальной информации Администрация сайта не несёт ответственность, если данная конфиденциальная информация:</p>
                <p>6.2.1. Стала публичным достоянием до её утраты или разглашения.</p>
                <p>6.2.2. Была получена от третьей стороны до момента её получения Администрацией сайта.</p>
                <p>6.2.3. Была разглашена с согласия Пользователя.</p>

                <h2>7. РАЗРЕШЕНИЕ СПОРОВ</h2>
                <p>7.1. До обращения в суд с иском по спорам, возникающим из отношений между Пользователем сайта nadoshokolada.ru и Администрацией сайта, обязательным является предъявление претензии (письменного предложения о добровольном урегулировании спора).</p>
                <p>7.2. Получатель претензии в течение 30 календарных дней со дня получения претензии, письменно уведомляет заявителя претензии о результатах рассмотрения претензии.</p>
                <p>7.3. При не достижении соглашения спор будет передан на рассмотрение в судебный орган в соответствии с действующим законодательством Российской Федерации.</p>
                <p>7.4. К настоящей Политике конфиденциальности и отношениям между Пользователем и Администрацией сайта применяется действующее законодательство Российской Федерации.</p>

                <h2>8. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</h2>
                <p>8.1. Администрация сайта вправе вносить изменения в настоящую Политику конфиденциальности без согласия Пользователя.</p>
                <p>8.2. Новая Политика конфиденциальности вступает в силу с момента ее размещения на Сайте nadoshokolada.ru, если иное не предусмотрено новой редакцией Политики конфиденциальности.</p>
                <p>8.3. Все предложения или вопросы по настоящей Политике конфиденциальности следует направлять электронную почту chocolate.course@gmail.com</p>
                <p>8.4. Действующая Политика конфиденциальности размещена на странице по адресу nadoshokolada.ru/privacy.</p>
            </div>
        </div>
    );
};

export default Privacy;